{
  "navi": {
      "aboutme": "Über mich",
      "skills": "Fähigkeiten",
      "projects": "Projekte",
      "contact": "Kontakt" 
  },

  "about-the-fold": {
      "button": "Nehmen Sie Kontakt auf"
  },
   
  "about-me": {
    "based": "Ansässig in Bendorf Sayn",
    "locate": "Bereit umzuziehen",
    "remote": "Bereit für Remote-Arbeit",
    "title": "WER IST MICHAEL?",
    "subline": "Über mich",
    "text": "Hallo! Ich bin Michael, ein Frontend-Entwickler, der leidenschaftlich daran interessiert ist, intuitive und effiziente digitale Erlebnisse zu schaffen. Mit einem natürlichen Problemlösungsansatz und einem geschulten Auge für Details habe ich mich darauf spezialisiert, komplexe Konzepte in visuell ansprechende und funktionale Web-Lösungen zu verwandeln. Lass uns zusammenarbeiten und etwas Außergewöhnliches aufbauen!",
    "button": "Lass uns reden"
  },

  "skills": {
    "stack": "MEIN STAPEL",
    "title": "Fähigkeiten",
    "text": "Ich habe Erfahrung im Aufbau von Projekten mit einer Vielzahl von Frontend-Technologien und Konzepten gesammelt. Mit einer starken Wachstumsmentalität erkunde ich ständig neue Bereiche, um meine Fähigkeiten zu erweitern."
  },

  "project": {
    "text-craft": "MEIN HANDWERK",
    "headline": "Projekte",
    "text-all": "Werfen Sie einen Blick auf einige meiner Projekte und sehen Sie meine Frontend-Fähigkeiten in Aktion. Jedes Projekt hebt meinen Ansatz hervor, responsive, benutzerfreundliche Designs mit effizientem Code zu erstellen.",
    "headline-join": "Join",
    "text-join": "Task-Manager inspiriert vom Kanban-System. Erstellen und organisieren Sie Aufgaben mit Drag-and-Drop-Funktionen, weisen Sie Benutzer und Kategorien zu.",
    "headline-debugger": "The Debugger",
    "text-debugger": "Springe, renne und wirf Spiel basierend auf einem objektorientierten Ansatz. Hilf Michael, Münzen und Sprays zu finden, um gegen die Bugs zu kämpfen.",
    "headline-pokedex": "DABubble",
    "text-pokedex": "Diese App ist ein Slack-Klon. Sie revolutioniert die Teamkommunikation und -zusammenarbeit mit ihrer intuitiven Benutzeroberfläche, Echtzeit-Messaging und robusten Kanalorganisation.",
    "button-pokedex": "Projekt Details",
    "button-debugger": "Projekt Details",
    "button-join": "Projekt Details"
  },
      
  "projects": {
    "debugger": {
      "description": "Springe, renne und werfe in einem objektorientierten Spiel. Hilf Michael, Münzen zu sammeln und Sprays zu finden, um gegen die verrückten Bugs zu kämpfen.",
      "implementationDetails": "Ein kurzer Text, der deine Rolle oder den Arbeitsablauf für dieses spezifische Projekt beschreibt. Lass einen Recruiter mehr über dein Wissen und deine Fähigkeit erfahren, strukturiert unabhängig oder im Team zu arbeiten."
    }
  },

  "thoughts": {
    "words": "IN IHREN WORTEN",
    "headline": "Gedanken der Kollegen",
    "cardOneText": "Michael hat das Team wirklich mit seiner großartigen Organisation und klaren Kommunikation zusammengehalten. Ohne sein Engagement wären wir nicht so weit gekommen.",
    "cardOneName": "Tobias Lange",
    "cardOnePosition": "Frontend Developer",
    "cardTwoText": "Es war eine große Freude, mit Michael zu arbeiten. Er weiß, wie man Teammitglieder motiviert und ermutigt, die bestmögliche Arbeit zu leisten, und bringt immer etwas in die Brainstorming-Sitzungen ein.",
    "cardTwoName": "Maria Schäfer",
    "cardTwoPosition": "Frontend Developer",
    "cardThreeText": "Michael war ein erstklassiger Teamkollege bei DA. Sein positives Engagement und seine Bereitschaft, Verantwortung zu übernehmen, haben maßgeblich dazu beigetragen, dass wir unsere Ziele erreicht haben.",
    "cardThreeName": "David Braun",
    "cardThreePosition": "Frontend Developer",
    "profile": "Profil"
  },
  
"contact": {
  "contactMe": "KONTAKTIERE MICH",
  "headline": "Bereit, zusammenzuarbeiten?",
  "contactText": "Kontaktieren Sie mich über dieses Formular, ich bin daran interessiert, von Ihnen zu hören, Ihre Ideen zu erfahren und mit meiner Arbeit zu Ihren Projekten beizutragen. Zögern Sie nicht, sich mit den Details Ihres Projekts zu melden. Ich würde mich freuen, die Gelegenheit zu haben, eine Website zu erstellen, die Ihren Anforderungen entspricht!",
  "name": "Wie lautet Ihr Name?",
  "email": "Wie lautet Ihre E-Mail?",
  "message": "Wie kann ich Ihnen helfen?",
  "privacyPolicy": "Ich habe die gelesen und stimme der Verarbeitung meiner Daten wie beschrieben zu.",
  "privacyPolicyLink": "Datenschutzerklärung",
  "accept": "Bitte akzeptieren Sie die Datenschutzerklärung",
  "send": "Senden"
  },

  "detail": {
  "goback": "Zurück",
  "description": "Beschreibung",
  "detailheadline": "Implementierungsdetails",
  "duration": "Dauer:",
  "next": "Nächste Projekt"
  }
}