{
  "navi": {
    "aboutme": "About Me",
    "skills": "Skills",
    "projects": "Projects",
    "contact": "Contacts" 
  },

"about-the-fold": {
  "button": "Get in Touch"
  },

"skills": {
  "stack": "MY STACK",
  "title": "Skill set",
  "text": "I have extensive experience in developing projects using modern frontend technologies and proven software architectures. My focus is on designing high-performance and user-friendly applications with a clear eye for design and functionality. At the same time, I am deeply engaged with future developments, particularly in the field of AI-powered applications, to create innovative solutions that elevate technology and user experience to the next level."
  },

"about-me": {
  "based": "Based in Bendorf Sayn",
  "locate": "Open to relocate",
  "remote": "Open to work remote",
  "title": "WHO`S MICHAEL?",
  "subline": "About me",
  "text": "Hello! I’m Michael, a certified media designer for digital media (IHK) and a frontend developer with a passion for aesthetic and functional designs. My focus is on designing, structuring, and planning modern user interfaces, as well as developing high-quality web solutions. With a keen eye for detail and professional coding skills, I transform complex concepts into intuitive digital experiences. Let’s work together to create innovative projects!",
  "button": "Let`s talk"
  },

"project": {
  "text-craft": "MY CRAFT",
  "headline": "Projects",
  "text-all": "Explore my projects and experience my frontend expertise firsthand. Each project reflects my commitment to crafting responsive, user-friendly designs while ensuring clean, efficient, and high-performance code.",
  "headline-join": "Join",
  "text-join": "Task manager inspired by the Kanban System. Create and organize tasks using drag and drop functions, assign users and categories. ",
  "headline-debugger": "The Debugger",
  "text-debugger": "Jump, run and throw game based on object-oriented approach. Help Michael to find coins and Sprays to fight against the Bugs.",
  "headline-pokedex": "Pokedex",
  "text-pokedex": "This application allows users to retrieve information about various Pokémon by entering a Pokémon name or Pokédex number.",
  "button-pokedex": "Project details",
  "button-debugger": "Project details",
  "button-join": "Project details"
},

  "projects": {
    "debugger": {
      "description": "An action-packed Jump ’n’ Run – fully designed, developed, and programmed by me! Jump, run, and throw your way through this object-oriented Jump ’n’ Run adventure. Guide Michael through exciting levels, collect coins, discover power-ups, and use sprays to take on the crazy bugs. A unique gaming experience that combines technical precision with creative game design!",
      "implementationDetails": "My Jump ’n’ Run – From Concept to Completion, All in One Hand This game is a complete solo project – from the first sketch to the final code. As the developer, designer, and programmer, I created and implemented every element myself. Concept & Design: The game world, characters, and UI were designed by me using Adobe Illustrator and Photoshop, with a strong focus on an appealing style and clear visual language. Development & Programming: The game is built with object-oriented JavaScript and utilizes HTML and CSS for a stable and responsive implementation. Clean, modular code ensures easy maintenance and scalability. Gameplay & Mechanics: I have crafted a smooth and dynamic Jump ’n’ Run experience, combining precise controls, exciting levels, and interactive elements. The goal was to create an engaging and technically refined gaming experience. This project showcases my skills in game design, front-end development, and object-oriented programming – all driven by attention to detail and a commitment to high quality"
    },

    "join": {
      "description": "Task manager inspired by the Kanban System. Create and organize tasks using drag and drop functions, assign users and categories.",
      "implementationDetails": "This project is a modern Kanban system developed with Angular 17, Firebase, and SCSS. It allows for the creation, organization, and management of tasks that can be moved between different status columns via drag and drop. Users can create tasks, assign categories and people, and track the progress of their workflows in real-time. The data is stored in Firestore and automatically synchronized."
    },

    "pokedex": {
      "description": "This application allows users to retrieve information about various Pokémon by entering a Pokémon name or Pokédex number.",
      "implementationDetails": "Short text that describes your role or the workflow for this specific project. Let a recruiter know more about your knowledge and ability to work independently or collaboratively in a structured way."
    }
  },
  

"thoughts": {
  "words": "IN THEIR WORDS",
  "headline": "Colleagues' Thoughts",
  "cardOneText": "Michael really kept the team together with his great organization and clear communication. We wouldn't have got this far without his commitment.",
  "cardOneName": "Tobias Lange",
  "cardOnePosition": "Frontend Developer",
  "cardTwoText": "It was a great pleasure to work with Michael. He knows how to push and encourage team members to present the best work possible, always adding something to brainstorm.",
  "cardTwoName": "Maria Schäfer",
  "cardTwoPosition": "Frontend Developer",
  "cardThreeText": "Michael was a top team colleague at DA. His positive commitment and willingness to take on responsibility made a significant contribution to us achieving our goals",
  "cardThreeName": "David Braun",
  "cardThreePosition": "Frontend Developer",
  "profile": "Profile"
  },

"contact": {
  "contactMe": "CONTACT ME",
  "headline": "Ready to work together?",
  "contactText": "Contact me through this form, I am interested in hearing from you, knowing your ideas and contributing to your projects with my work. Feel free to get in touch with your project details. I'd love the opportunity to help create a website that meets your needs!",
  "name": "What`s your name?",
  "email": "What`s your email?",
  "message": "How can I help you?",
  "privacyPolicy": "I've read the and agree to the processing of my data as outlined.",
  "privacyPolicyLink": "privacy policy",
  "accept": "Please accept the privacy policy",
  "send": "Send",
  "nameerror": "Oops! it seems your name is missing ",
  "nameplaceholder": "Your name goes here",
  "emailerror": "Hoppla! your email is required",
  "emailplaceholder": "Your name goes here",
  "messageerror": "What do you need to develop?",
  "messageplaceholder": "Your message goes here",
  "signin": "Your email has been successfully sent"
  },

"detail": {
  "goback": "Go Back",
  "description": "Description",
  "detailheadline": "Implementation Details",
  "duration": "Duration:",
  "next": "Next Project"
  },

  "imprint": {
    "imprint": "Legal Notice",
    "contact": "Contact",
    "disclaimer": "Disclaimer",
    "privacypolice": "Privacy Policy"
  }
}